const _scheduleConfig = {

    // 倒计时目标：位于右侧框中的倒计时，输入日期即可，可以是中考高考期末等等，格式YYYY-MM-DD
    // 若想隐藏右侧的倒计时，请在下方冒号后填入'hidden', (包括引号)
    countdown_target: '2024-6-7',

    // 星期显示：左侧框是否显示，显示为true，隐藏为false
    // 直接将true或false填入冒号后边，没有引号
    week_display: true,

    // 科目名称：所有课程科目的简写及其对应全称，冒号前面(key)为简写，后面(value)为全称，不限字数，
    // 若存在多个课程简写相同，需要加以区分，可以为简写添加下角标，使用@分隔，如'自@语'，@前为简写，@后为下角标
    // 要求必须做到覆盖完全，否则可能会保错
    subject_name: {
        '自': '自习',
        '自@午': '午自习',
        '自@一': '晚自习一',
        '自@二': '晚自习二',
        '语': '语文',
        '数': '数学',
        '外@走': '外语（走班）',
        '物': '物理',
        '化': '化学',
        '生': '生物',
        '地': '地理',
        '政': '政治',
        '史': '历史',
        '体@走': '体育（走班）',
        '音@走': '音乐（走班）',
        '信@走': '信息（走班）',
        '通@走': '通用技术（走班）',
        '选@走': '选修课（走班）',
    },

    // 时间表: 每天课程安排的时间表，内层冒号前面为时间，后面为课程序号(从0开始的数字[不带'']) 或 课间具体名称(用''包裹中间写文字)
    // 这里的例子workday和weekend（外层）只是举例，你也可以自定义其名字(第一个字符不要为数字)
    // 比如如果你的学校周三半天，你可以在这里单独添加一个wednesday: {...}
    // 注：时间段中-后的时间要减一分钟 比如某节课40分钟，时间段为08:00-08:40，但实际配置时要配置'08:00-08:39'
    timetable: {
        type1: {
            '00:00-07:29': '早安',
            '07:30-07:44': '早读',
            '07:45-08:24': 0,
            '08:25-08:34': '课间',
            '08:35-09:14': 1,
            '09:15-09:44': '课间',
            '09:45-10:24': 2,
            '10:25-10:34': '大课间',
            '10:35-11:14': 3,
            '11:15-11:29': '课间',
            '11:30-12:09': 4,
            '12:10-12:49': '午休',
            '12:50-13:24': 5,
            '13:25-13:29': '课间',
            '13:30-14:09': 6,
            '14:10-14:14': '音乐欣赏',
            '14:15-14:24': '课间',
            '14:25-15:04': 7,
            '15:05-15:19': '大课间',
            '15:20-15:59': 8,
            '16:00-16:09': '课间',
            '16:10-16:49': 9,
            '16:50-16:59': '课间',
            '17:00-17:39': 10,
            '17:40-18:29': '晚休',
            '18:30-19:59': 11,
            '20:00-20:14': '课间',
            '20:15-21:29': 12,
            '21:30-23:59': '晚安',
        },
        type2: {
            '00:00-07:29': '早安',
            '07:30-07:44': '早读',
            '07:45-08:24': 0,
            '08:25-08:34': '课间',
            '08:35-09:14': 1,
            '09:15-09:44': '课间',
            '09:45-10:24': 2,
            '10:25-10:34': '大课间',
            '10:35-11:14': 3,
            '11:15-11:29': '课间',
            '11:30-12:09': 4,
            '12:10-12:49': '午休',
            '12:50-13:24': 5,
            '13:25-13:29': '课间',
            '13:30-14:09': 6,
            '14:10-14:14': '音乐欣赏',
            '14:15-14:24': '课间',
            '14:25-15:04': 7,
            '15:05-15:19': '大课间',
            '15:20-15:59': 8,
            '16:00-16:09': '课间',
            '16:10-16:49': 9,
            '16:50-18:29': '晚休',
            '18:30-19:59': 10,
            '20:00-20:14': '课间',
            '20:15-21:29': 11,
            '21:30-23:59': '晚安',
        },
        type3: {
            '00:00-07:29': '早安',
            '07:30-07:44': '早读',
            '07:45-08:24': 0,
            '08:25-08:34': '课间',
            '08:35-09:14': 1,
            '09:15-09:44': '课间',
            '09:45-10:24': 2,
            '10:25-10:34': '大课间',
            '10:35-11:14': 3,
            '11:15-11:29': '课间',
            '11:30-12:09': 4,
            '12:10-12:49': '午休',
            '12:50-13:24': 5,
            '13:25-13:29': '课间',
            '13:30-14:09': 6,
            '14:10-14:14': '音乐欣赏',
            '14:15-14:24': '课间',
            '14:25-15:04': 7,
            '15:05-15:19': '大课间',
            '15:20-15:59': 8,
            '16:00-16:09': '课间',
            '16:10-17:39': 9,
            '17:40-18:29': '晚休',
            '18:30-19:59': 10,
            '20:00-20:14': '课间',
            '20:15-21:29': 11,
            '21:30-23:59': '晚安',
        },
        weekend: {
            '00:00-23:59': '今日无课程',
        }
    },

    // 分隔线: 课表中区分不同时段课程的分隔线配置，外层key（冒号前）部分与上面timeable相同
    // value（冒号后）为分隔线所在位置的前一个课程序号(从0开始的数字[不带''])
    divider: {
        type1: [5, 1, 5, 2],
        type2: [5, 1, 4, 2],
        type3: [5, 1, 4, 2],
        weekend: [1]
    },

    // 每日课程：配置星期几对应第几堂课是什么课，星期顺序不可以更改(星期日/一/二/三/四/五/六)，你可以对classList后面内容进行更改
    // 从classList后最外的中括号看起，里面的第几个元素的序号-1就是该元素的下标，这个下标对应你在上面timetable中配置的数字，课程用单引号包含，写入在subject_name中配置的简写
    // 如果该节课可能存在每周轮换，你可以用一个中括号把他们全部写进去如: ['(第一周课)物', '(第二周)化', '(第三周)地', '(第四周)数'](小括号及其内容无需填写, 最多支持四周轮换)
    // 下面的timetable中配置该日属于在上面的timetable中的哪一类，如周日属于weekend就这样写 timetable: 'weekend'，用单引号包含
    daily_class: [
        {
            Chinese: '日',
            English: 'SUN',
            classList: [],
            timetable: 'weekend'
        },
        {
            Chinese: '一',
            English: 'MON',
            classList: ['数', '语', '信@走', '化', '物', '自@午', '外@走', '外@走', '地', '班', '自@一', '自@二'],
            timetable: 'type2'
        },
        {
            Chinese: '二',
            English: 'TUE',
            classList: ['外@走', '外@走', '数', '体@走', '体@走', '自@午', '政', '物', '音@走', '史', '自@一', '自@二'],
            timetable: 'type2'
        },
        {
            Chinese: '三',
            English: 'WED',
            classList: ['数', '数', '外@走', '语', '语', '自@午', '物', '化', '信@走', '生', '自@一', '自@二'],
            timetable: 'type2'
        },
        {
            Chinese: '四',
            English: 'THR',
            classList: ['地', '数', '物', '语', '通@走', '自@午', '体@走', '外@走', '外@走', '选@走', '自@一', '自@二'],
            timetable: 'type3'
        },
        {
            Chinese: '五',
            English: 'FRI',
            classList: ['语', '数', '化', '外@走', '外@走', '自@午', '生', '政', '史', '选@走', '自@一', '自@二'],
            timetable: 'type3'
        },
        {
            Chinese: '六',
            English: 'SAT',
            classList: [],
            timetable: 'weekend'
        }
    ],


    // 课表样式: 配置课表样式CSS变量, 包括字体大小，透明度等属性
    // 请不要更改冒号前半部分文字, 请更改冒号后单引号中的数字(切勿删除引号与数字后的单位), 如果你对CSS有所了解你也可以尝试更改CSS单位
    css_style: {
        '--center-font-size': '50px', // 中间课表中的课程简写单字的字体大小
        '--corner-font-size': '14px', // 左侧的星期中文角标与右侧的"天"字的字体大小
        '--countdown-font-size': '28px', // 课程或课间全称与倒计时的字体大小
        '--global-border-radius': '16px', // 所有背景框的圆角大小
        '--global-bg-opacity': '0.5', // 所有背景框的不透明度, 范围: [0, 1]
        '--container-bg-padding': '8px 14px', // 上面三个框各自的背景内边距, 前面的数字表示纵向边距，后面的数字表示横向边距
        '--countdown-bg-padding': '5px 12px', // 倒计时框的背景内边距, 前面的数字表示纵向边距，后面的数字表示横向边距
        '--container-space': '16px', // 上面三个框中间的间隔长度
        '--top-space': '16px', // 课表主体最顶端与电脑屏幕上边框的间隔长度
        '--main-horizontal-space': '8px', // 中间课表中的课程简写单字之间的间隔长度
        '--divider-width': '2px', // 分隔线宽度
        '--divider-margin': '6px', // 分隔线外边距
        '--triangle-size': '16px', // 倒计时框上方小三角箭头的大小
        '--sub-font-size': '20px', // 中间课表中的课程下角标(X@X)的字体大小
    }
}

var scheduleConfig = JSON.parse(JSON.stringify(_scheduleConfig))
